{
    "products": [
      {
        "id": 1,
        "product_name": "Modern Slim Fit Suit",
        "product_type":"Coats",
        "mrp_price": "44.90",
        "marked_price": "82.50",
        "image_url": "/images/product-1.png",
        "default_size": "L",
        "mark_discount":"SALE!",
        "stock":"16",
        "quantity": 1,              
        "currency": "$",
        "review":"4.5 (100 reviews)",
        "category":"Women",
        "product_desc": "Elevate your look with this modern slim fit suit, tailored for a sleek, contemporary silhouette. Perfect for formal occasions or business wear, it combines sharp styling with all-day comfort and a confident, polished appearance.",
        "product_desc1": "Refined and modern, this slim fit suit is designed to complement your physique with a clean, tailored look. The jacket features a tapered cut and narrow lapels, while the trousers offer a streamlined fit. Crafted from breathable, high-quality fabric, it ensures lasting comfort and sharp style throughout the day. Ideal for weddings, business meetings, or special events, this suit is a must-have for the well-dressed, modern gentleman.",
        "styling_tips": "Style your modern slim fit suit with a crisp, tailored shirt to maintain its sleek silhouette. For formal occasions, pair it with a slim tie, pocket square, and polished leather shoes like Oxfords or brogues. Add a classic watch or tie bar for a sophisticated touch. For a more relaxed, fashion-forward look, try layering with a turtleneck or fitted tee and finish with loafers or Chelsea boots. Keep grooming sharp to complete the refined ensemble.",
        "key_features": [ 
        "Narrow through the thigh with a tapered ankle and clean hemline",
        "Looks great with shirts, turtlenecks, or even casual tees",
        "Stylish lining, subtle stitching, and contemporary button closure",
        "Multiple interior and exterior pockets for convenience",
        "Suitable for office, weddings, parties, or evening events"
      ],
        "imageArray": [
          { "id": 1, "url": "/images/product-1.png" },
          { "id": 2, "url": "/images/product-1-1.png" },
          { "id": 3, "url": "/images/product-1-2.png" },
          { "id": 4, "url": "/images/product-1-3.png" }
        ],
        "productreview": [
          { 
            "id": 1, 
            "images": "/images/review-1.jpg",
            "proName":"Emma Johnson",
            "text":"I bought the Modern Slim Fit Suit for a formal event, and it exceeded all expectations. The fit is sleek and flattering without feeling too tight. The fabric feels premium and breathable—perfect for all-day wear. I received multiple compliments throughout the night. Highly recommended for anyone looking for a stylish and sharp look!",
            "date":"June 10, 2025"
          },
          { 
            "id": 2, 
            "images": "/images/review-1-1.jpg",
            "proName":"Olivia Martinez",
            "text":"I was a little hesitant to order a suit online, but this one fits like it was tailored for me. The cut is modern and professional, and it pairs well with both dress shoes and sneakers. I wore it to a wedding and felt super confident.",
            "updatedate":"June 15, 2025"
          },
          { 
            "id": 3, 
            "images": "/images/review-1-2.jpg",
            "proName":"Amelia Brown",
            "text":"The suit looks much more expensive than it actually is. The material is lightweight and ideal for warm weather. I only gave 4 stars because I had to get the sleeves slightly altered, but overall, a fantastic purchase.",
            "date":"June 17, 2025"
          }
        ]
        
      },
          {
            "id":2,
            "product_name": "Trendy Denim Jacket with Patches",
            "product_type":"KidJacket",
            "mrp_price": "45.90",
            "marked_price": "121.00",
            "image_url": "/images/product-2.png",
            "default_size": "M",
            "mark_discount":"SALE!",
            "stock":"16",
            "quantity": 1,              
             "currency": "$",
             
       "review":"4.5 (95 reviews)",
        "category":"Man",
        "product_desc": "Make a bold statement with this trendy denim jacket featuring unique patches. Designed for everyday street style, it combines classic denim with eye-catching details, perfect for layering over casual outfits all year round.",
        "product_desc1": "Show off your personality with this trendy denim jacket, decorated with stylish and vibrant patches. The jacket blends timeless denim appeal with a modern streetwear vibe, making it ideal for casual outings, concerts, or weekend wear. Featuring a comfortable fit and durable stitching, it layers effortlessly over tees, hoodies, or dresses. Stand out in any crowd with this must-have fashion piece that brings attitude and character to your everyday wardrobe.",
        "styling_tips": "Elevate your street style by pairing this trendy denim jacket with graphic tees, joggers, or ripped jeans for a bold, urban look. For a more casual vibe, throw it over a plain white T-shirt and sneakers. Layer it with hoodies or flannel shirts in cooler weather, or wear it open over dresses or skirts for a playful contrast. Accessorize with sunglasses, a beanie, or chunky sneakers to complete the edgy, modern outfit.",
        "key_features": [
        "Relaxed or slightly oversized fit for easy layering over any outfit",
        "Chest and side pockets for style and convenience",
        "Traditional button closure for a classic denim jacket silhouette",
        "Designed to suit a wide range of personal styles and body types"
      ],
        "imageArray": [
          { "id": 1, "url": "/images/product-2.png" },
          { "id": 2, "url": "/images/product-2-1.png" },
          { "id": 3, "url": "/images/product-2-2.png" }
        
        ],
        "productreview": [
          { 
            "id": 1, 
            "images": "/images/review-2.jpg",
            "proName":"Michael P.",
            "text":"This jacket gets me compliments every time I wear it! The patches give it such a unique vibe, and the denim quality is thick but soft. It fits true to size and works great with casual outfits.",
            "date":"June 09, 2025"
          },
          { 
            "id": 2, 
            "images": "/images/review-2-1.jpg",
            "proName":"David R.",
            "text":"I love the overall look and feel—especially the edgy patches! Just a heads up: it’s a bit oversized, but that worked perfectly for my street-style aesthetic.",
            "updatedate":"June 07, 2025"
          },
          { 
            "id": 3, 
            "images": "/images/review-2-2.jpg",
            "proName":"Jonathan K.",
            "text":"Absolutely love this piece! The detailing on the patches is super well-done, and the washed denim has a premium feel. Great for layering over tees or hoodies.",
            "date":"June 11, 2025"
          }
        ]
          },
          {
            "id":3,
            "product_name": "Inspired Floral Midi Dress",
            "product_type":"Shirt",
            "mrp_price": "48.00",
            "marked_price":"60.00",
            "image_url": "/images/product-3.png",
            "default_size": "S",
            "mark_discount":"SALE!",
            "stock":"16",
            "quantity": 1,              
           "currency": "$",
          
       "review":"4.0 (80 reviews)",
       "category":"Women",
        "product_desc": "Embrace elegance with this inspired floral midi dress, designed to flatter with its flowy silhouette and romantic print. Perfect for brunches, garden parties, or casual days out with a feminine, timeless charm.",
        "product_desc1": "Step into effortless elegance with this inspired floral midi dress. Featuring a graceful midi length, soft fabric, and a delicate floral print, it brings a touch of romance to any occasion. The flattering silhouette and breezy design make it ideal for brunches, weddings, or daytime outings. Pair it with sandals for a relaxed look or dress it up with heels and accessories for a more polished, chic ensemble.",
        "styling_tips": "Elevate the look with strappy heels and delicate jewelry for weddings or garden parties. For a casual daytime vibe, pair the dress with flat sandals, a denim jacket, and a woven tote bag. In cooler weather, layer with a cropped cardigan or light trench and ankle boots. Add a wide-brim hat and sunglasses for a chic, breezy summer style. Keep makeup soft and romantic to complement the floral design.",
        "key_features": [
        "Hits mid-calf for a flattering and versatile silhouette",
        "Soft, romantic patterns that add feminine charm",
        "Breathable and flowy material for comfort and movement",
        "Cinched waist or wrap-style to enhance natural curves",
        "Suitable for casual, semi-formal, or special occasions"
      ],
        "imageArray": [
          { "id": 1, "url": "/images/product-3.png" },
          { "id": 2, "url": "/images/product-3-1.png" }
         
        ],
         "productreview": [
          { 
            "id": 1, 
            "images": "/images/review-3.jpg",
            "proName":"Luna Brooks",
            "text":"This dress is absolutely beautiful. The floral pattern is soft and romantic, and the fabric moves like a dream. Perfect for brunch, a garden party, or even a date night. I felt so confident wearing it!",
            "date":"June 01, 2025"
          },
          { 
            "id": 2, 
            "images": "/images/review-3-1.jpg",
            "proName":"Nova Bennett",
            "text":"I loved how this midi dress hugged my waist and flared gently at the bottom. It’s true to size, and the colors are even prettier in person. Just wish the sleeves had a little more stretch.",
            "updatedate":"June 22, 2025"
          },
          { 
            "id": 3, 
            "images": "/images/review-3-2.jpg",
            "proName":"Freya Morgan",
            "text":"Wore this to a summer wedding and got endless compliments. It’s light, breathable, and the floral design isn’t too loud—just the right amount of charm.",
            "date":"June 15, 2025"
          }
        ]
          },
          {
            "id":4,
            "product_name": "Trendy Denim Jacket",
            "product_type":"Jacket",
            "mrp_price": "49.90",
            "marked_price": "88.00",
            "image_url": "/images/product-4.png",
            "default_size": "XS",
            "mark_discount":"SALE!",
            "stock":"16",
            "quantity": 1,              
             "currency": "$",
             
       "review":"5.0 (110 reviews)",
        "category":"Man",
        "product_desc": "Stay effortlessly cool in this trendy denim jacket, a timeless wardrobe staple with modern edge. Perfect for layering, it pairs well with everything from dresses to joggers, offering all-season style and versatility.",
        "product_desc1": "Add a stylish edge to your wardrobe with this trendy denim jacket. Designed with a classic fit and durable denim fabric, it’s perfect for layering over tees, dresses, or hoodies. Whether you're heading out for a casual day or dressing up for a night out, this jacket delivers effortless style and comfort. Its versatile design makes it a must-have staple for all seasons and any outfit combination.",
        "styling_tips": "Layer this trendy denim jacket over a white tee and black jeans for a classic look, or pair it with a floral dress and sneakers for a casual-chic outfit. In cooler months, wear it over a hoodie or turtleneck for extra warmth and edge. For streetwear vibes, combine with joggers and chunky sneakers. Roll up the sleeves for a relaxed touch and add a crossbody bag to complete the outfit.",
        "key_features": [
        "Relaxed or regular fit suitable for layering in all seasons",
        "Machine washable and low-maintenance",
        "Available in light, medium, or dark denim washes",
        "Great for layering in spring, fall, and cool summer nights"
      ],
        "imageArray": [
          { "id": 1, "url": "/images/product-4.png" },
          { "id": 2, "url": "/images/product-4-1.png" }
         
        ],
         "productreview": [
          { 
            "id": 1, 
            "images": "/images/review-4.jpg",
            "proName":"Grayson M.",
            "text":"This denim jacket is a staple in my wardrobe now. It has that classic vintage feel but fits perfectly with today’s trends. I wear it over dresses, tees, and even hoodies. Super versatile!",
            "date":"June 11, 2025"
          },
          { 
            "id": 2, 
            "images": "/images/review-4-1.jpg",
            "proName":"William C.",
            "text":"The fabric is thick and feels durable. The stitching is neat, and it’s surprisingly warm for a denim jacket. I gave 4 stars only because I wish it had an inside pocket.",
            "updatedate":"June 13, 2025"
          },
          { 
            "id": 3, 
            "images": "/images/review-4-2.jpg",
            "proName":"David S.",
            "text":"I’ve been searching for a good denim jacket, and this one is just perfect. The wash is stylish, and the fit is slightly oversized—exactly how I like it.",
            "date":"June 16, 2025"
          }
        ]
          },
          {
            "id":5,
            "product_name": "Cozy Knit Oversized Sweater",
            "product_type":"Sweater",
            "mrp_price": "35.00",
            "marked_price": "99.00",
            "image_url": "/images/product-5.png",
            "default_size": "XS",
            "mark_discount":"SALE!",
            "stock":"16",
            "quantity": 1,             
          "currency": "$",
          
          "review":"5.0 (101 reviews)",
        "category":"Women",
        "product_desc": "Wrap yourself in warmth with this cozy knit oversized sweater. Designed for comfort and effortless style, it’s perfect for chilly days, pairing easily with jeans, leggings, or layered over dresses for a relaxed, chic look.",
        "product_desc1": "Stay warm and stylish with this cozy knit oversized sweater, crafted for ultimate comfort. The relaxed fit and soft-touch fabric make it a go-to piece for lounging, casual outings, or layering on cooler days. Its versatile design pairs effortlessly with jeans, leggings, or skirts, while the textured knit adds timeless charm. Whether you're working from home or heading out, this sweater brings the perfect blend of comfort and fashion to your wardrobe.",
        "styling_tips": "Pair your oversized knit sweater with skinny jeans or leggings to balance the silhouette and create a flattering look. For a cozy chic outfit, wear it with a midi skirt and ankle boots. Layer over a collared shirt for a preppy twist, or throw it on with biker shorts for a modern, relaxed vibe. Add a beanie or scarf in colder weather for extra warmth and effortless style.",
        "key_features": [
        "Relaxed, roomy silhouette for a cozy, laid-back feel",
        "Warm, breathable, and gentle on the skin",
        "Keeps shape while adding subtle detail",
        "Adds to the slouchy, comfortable look"
      ],
        "imageArray": [
          { "id": 1, "url": "/images/product-5.png" },
          { "id": 2, "url": "/images/product-5-1.png" },
          { "id": 3, "url": "/images/product-5-2.png" }
         
        ],
        "productreview": [
          { 
            "id": 1, 
            "images": "/images/review-5.jpg",
            "proName":"Emily R",
            "text":"This sweater is like wearing a warm hug. The knit is super soft and not scratchy at all. It’s oversized but still flattering. Perfect with leggings or jeans.",
            "date":"June 02, 2025"
          },
          { 
            "id": 2, 
            "images": "/images/review-5-1.jpg",
            "proName":"Jessica L",
            "text":"I love the chunky knit and the slouchy sleeves. It’s cozy without being too heavy. Lost one star because it took a week to arrive, but otherwise, it’s perfect!",
            "updatedate":"June 06, 2025"
          },
          { 
            "id": 3, 
            "images": "/images/review-5-2.jpg",
            "proName":"Rachel K",
            "text":"I’ve worn this almost every day since I got it. It’s perfect for layering and goes great with boots. The oatmeal color is gorgeous in person.",
            "date":"June 10, 2025"
          }
        ]
          },
          {
            "id":6,
            "product_name": "Red Rasual T-shirt",
            "product_type":"Tshirt",
            "mrp_price": "45.90",
            "marked_price":"119.90",
            "image_url": "/images/product-6.png",
            "mark_discount":"SALE!",
            "stock":"16",
            "quantity": 1,              
         "currency": "$",
       
        "review":"5.0 (90 reviews)",
        "category":"Man",
        "product_desc": "Keep it simple and stylish with this red casual T-shirt. Made from soft, breathable fabric, it offers all-day comfort and pairs perfectly with jeans, shorts, or joggers for an easy, everyday look.",
        "product_desc1": "Add a pop of color to your wardrobe with this red casual T-shirt, designed for effortless comfort and style. Crafted from soft, breathable cotton or cotton-blend fabric, it’s ideal for everyday wear, whether you're lounging, running errands, or meeting friends. The classic crew neck and regular fit make it a versatile piece that pairs easily with jeans, shorts, or joggers. A must-have essential for any laid-back, modern wardrobe.",
        "styling_tips": "Pair your red casual T-shirt with blue or black jeans for a classic look, or go sporty with joggers and sneakers. For a street-style edge, layer it under a denim or leather jacket. In summer, combine with khaki or beige shorts and sunglasses for a fresh, bold vibe. Tuck it into a skirt or high-waisted trousers for a laid-back yet polished outfit. Finish with minimal accessories to let the color pop.",
        "key_features": [
        "Adds a bold, stylish pop to your everyday outfits",
        "Timeless design that suits all face shapes",
        "Comfortable and relaxed, ideal for daily wear",
        "Perfect for warm weather or easy layering",
        "Suitable for all genders and casual occasions"
      ],
        "imageArray": [
          { "id": 1, "url": "/images/product-6.png" },
          { "id": 2, "url": "/images/product-6-1.png" },
          { "id": 2, "url": "/images/product-6-2.png" }
         
        ],
        "productreview": [
          { 
            "id": 1, 
            "images": "/images/review-6.jpg",
            "proName":"Jason M.",
            "text":"The red color pops beautifully and doesn’t fade after washing. The fabric is breathable and super soft—perfect for summer wear. Got tons of compliments!",
            "date":"June 23, 2025"
          },
          { 
            "id": 2, 
            "images": "/images/review-6-1.jpg",
            "proName":"Brian S.",
            "text":"Really comfy and easy to wear. I pair it with jeans or joggers, and it always works. Slightly looser than expected, but still looks good.",
            "updatedate":"June 15, 2025"
          },
          { 
            "id": 3, 
            "images": "/images/review-6-2.jpg",
            "proName":"Tyler J.",
            "text":"This Red Rasual T-shirt has become my favorite. The fit is modern, not too tight or baggy, and the material feels premium for the price.",
            "date":"June 12, 2025"
          }
        ]
          },
          {
            "id":7,
            "product_name": "Elegant Lace Cocktail Dress",
            "product_type":"Coats",
            "mrp_price": "48.00",
            "marked_price": "97.90",
            "image_url": "/images/product-7.png",
            "mark_discount":"SALE!",
            "stock":"16",
            "quantity": 1,              
           "currency": "$",
           
        "review":"4.5 (98 reviews)",
        "category":"Women",
        "product_desc": "Turn heads in this elegant lace cocktail dress, featuring delicate detailing and a flattering silhouette. Perfect for weddings, parties, or evening events, it offers timeless charm with a touch of modern sophistication.",
        "product_desc1": "Make a lasting impression with this elegant lace cocktail dress, designed to highlight your feminine charm. The intricate lace overlay, fitted bodice, and graceful hemline create a refined and flattering silhouette. Ideal for formal dinners, weddings, or special celebrations, this dress pairs beautifully with heels and subtle accessories. Its timeless design and delicate detailing make it a go-to choice for any event where elegance and confidence are key.",
        "styling_tips": "Pair this elegant lace cocktail dress with strappy heels or classic pumps for a polished look. Add a clutch bag and delicate jewelry like pearl earrings or a dainty necklace to elevate the ensemble. For cooler weather, layer with a fitted blazer or a chic shawl. Opt for a sleek updo or soft waves to complement the dress’s romantic vibe. Finish with subtle makeup and a touch of highlighter for an elegant glow.",
        "key_features": [
        "Intricate lace overlay for a timeless, romantic look",
        "Fitted bodice with a defined waist for a graceful shape",
        "Soft lining ensures comfort while maintaining a refined finish",
        "Easy to wear with a clean, seamless appearance"
      ],
        "imageArray": [
          { "id": 1, "url": "/images/product-7.png" },
          { "id": 2, "url": "/images/product-7-1.png" }
         
          
        ],
         "productreview": [
          { 
            "id": 1, 
            "images": "/images/review-7.jpg",
            "proName":"Olivia W.",
            "text":"This dress is a total showstopper. The lace detail is so delicate and high-quality. I wore it to a formal dinner and felt like a movie star. It hugs all the right places without being too tight.",
            "date":"June 30, 2025"
          },
          { 
            "id": 2, 
            "images": "/images/review-7-1.jpg",
            "proName":"Ashley M.",
            "text":"The design is gorgeous, and the lace feels soft—not scratchy. I had to size up for a comfortable fit around the bust, but once I did, it was perfect.",
            "updatedate":"June 27, 2025"
          },
          { 
            "id": 3, 
            "images": "/images/review-7-2.jpg",
            "proName":"Lauren B.",
            "text":"I wore this to my friend’s engagement party and got so many compliments. The length is perfect—classy without being too modest—and the color was exactly like the photo.",
            "date":"June 23, 2025"
          }
        ]
          },
          {
            "id":8,
            "product_name": "Classic Hoodie",
            "product_type":"Hoodie",
            "mrp_price": "56.00",
            "marked_price":"70.00",
            "image_url": "/images/product-8.png",
            "default_size": "XL",
            "mark_discount":"SALE!",
            "stock":"16",
            "quantity": 1,             
         "currency": "$",
        
        "review":"4.5 (99 reviews)",
        "category":"Man",
        "product_desc": "Stay warm and relaxed in this classic hoodie, designed with soft fabric and a timeless fit. Perfect for casual days, workouts, or layering, it offers everyday comfort with effortless style in any season.",
        "product_desc1": "This classic hoodie delivers the perfect balance of comfort and casual style. Crafted from soft, breathable fabric with a relaxed fit, it’s ideal for everyday wear, lounging, or layering over your gym gear. Featuring a drawstring hood, kangaroo pocket, and ribbed cuffs, it combines functionality with timeless design. Whether you're running errands or staying cozy indoors, this hoodie is a wardrobe essential for all seasons and every style.",
        "styling_tips": "Pair your classic hoodie with jeans and sneakers for a laid-back, everyday look. For an athleisure vibe, match it with joggers or leggings and trainers. Layer under a denim or leather jacket for extra style during cooler months. Dress it up slightly with chinos and boots or keep it ultra-relaxed with shorts and slides. Choose bold colors for a statement or go neutral for timeless versatility.",
        "key_features": [
        "Suitable for all genders and age groups",
        "Ideal for layering over tees or under jackets",
        "Machine washable and durable for everyday wear",
        "Ensures a snug fit and helps retain shape",
        "Drawstring hood for added warmth and personalized fit"
      ],
        "imageArray": [
          { "id": 1, "url": "/images/product-8.png" },
          { "id": 2, "url": "/images/product-8-1.png" },
          { "id": 3, "url": "/images/product-8-2.png" }
        ],
          "productreview": [
          { 
            "id": 1, 
            "images": "/images/review-8.jpg",
            "proName":"Daniel R.",
            "text":"This hoodie is my go-to for chilly mornings. The fleece inside is incredibly soft, and it keeps me warm without being too bulky. Fits perfectly too!",
            "date":"June 03, 2025"
          },
          { 
            "id": 2, 
            "images": "/images/review-8-1.jpg",
            "proName":"Eric T.",
            "text":"I wear this hoodie to the gym, to run errands, or just lounge at home. It’s comfy and durable. Just wish it came in more color options.",
            "updatedate":"June 05, 2025"
          },
          { 
            "id": 3, 
            "images": "/images/review-8-2.jpg",
            "proName":"Jake M.",
            "text":"Sometimes you just need a classic hoodie that works with anything—and this one nails it. The fit is relaxed but not sloppy, and the material feels premium.",
            "date":"June 07, 2025"
          }
        ]
          }
    ],

"featured_products": [
  {   
  "id":9,
  "product_name": "Men's Bomber Jacket",
  "product_type":"ZipperJacket",
  "mrp_price": "41.00",
  "marked_price": "99.00",
  "image_url": "/images/product-9.png",
  "default_size": "XXL",
  "mark_discount":"SALE!",
  "stock":"16",
  "quantity": 1,
        "currency": "$",
        
        "review":"4.0 (70 reviews)",
        "category":"Man",
        "product_desc": "Add a bold edge to your look with this men's bomber jacket. Featuring a sleek silhouette, zip closure, and ribbed trim, it’s perfect for layering and pairs effortlessly with jeans, joggers, or casual trousers.",
        "product_desc1": "This men’s bomber jacket blends timeless military-inspired design with modern street style. Crafted from durable fabric with a smooth lining, it features a zip-up front, ribbed cuffs and hem, and functional pockets for utility and style. Perfect for transitional weather, it layers easily over T-shirts or hoodies. Whether you're heading out for a casual day or a night in the city, this bomber adds a sharp finish to any outfit.",
        "styling_tips": "For a classic casual look, pair your bomber jacket with a white T-shirt, slim jeans, and sneakers. Elevate your outfit with chinos and leather boots for a smart-casual vibe. Layer it over a hoodie for a relaxed streetwear style, or wear it with joggers for an athleisure feel. Go for neutral tones for versatility or bold colors and patches to make a statement. Sunglasses and a cap complete the urban look.",
        "key_features": [
        "Easy to wear and great for layering",
        "Side and/or sleeve pockets for utility and style",
        "Great for spring, fall, and cool summer evenings"
      ],
        "imageArray": [
          { "id": 1, "url": "/images/product-9.png" },
          { "id": 2, "url": "/images/product-9-1.png" },
          { "id": 3, "url": "/images/product-9-2.png" }
          
        ],
  "productreview": [
          { 
            "id": 1, 
            "images": "/images/review-9.jpg",
            "proName":"Alex D.",
            "text":"This bomber jacket looks even better in person. It has that perfect balance of sporty and sophisticated. Fits true to size, and the zippers feel sturdy.",
            "date":"June 12, 2025"
          },
          { 
            "id": 2, 
            "images": "/images/review-9-1.jpg",
            "proName":"Marcus H.",
            "text":"Love the lightweight feel. It’s warm enough for cool evenings but not bulky. The inner lining is smooth and comfortable. Lost a star because I wish it had an inside pocket.",
            "updatedate":"June 17, 2025"
          },
          { 
            "id": 3, 
            "images": "/images/review-9-2.jpg",
            "proName":"Jordan C.",
            "text":"I wear this jacket everywhere—work, dinner, weekend trips. It fits like a glove and gives off a clean, urban vibe. Got compliments the first day I wore it.",
            "date":"June 29, 2025"
          }
        ]
},
{
  "id":10,
  "product_name": "Cargo Shorts for Active Boys",
  "product_type":"Coats",
  "mrp_price": "48.90",
  "marked_price": "77.00",
  "image_url": "/images/product-10.png",
  "default_size": "M",
  "mark_discount":"SALE!",
  "stock":"16",
  "quantity": 1,             
        "currency": "$",
        "addedby": "100",
       
        "review":"4.0 (75 reviews)",
        "category":"Man",
        "product_desc": "Designed for movement and play, these cargo shorts for active boys offer comfort, durability, and plenty of pocket space. Perfect for school, sports, or weekend adventures, they’re a warm-weather essential for energetic kids.",
        "product_desc1": "Keep up with your little one’s energy in these durable cargo shorts for active boys. Made from breathable, lightweight fabric, they feature a comfortable elastic waistband and multiple pockets for all-day convenience. Whether he's climbing, running, biking, or exploring, these shorts are built for movement and adventure. Ideal for school days or outdoor play, they offer the perfect blend of comfort, function, and style for active young explorers.",
        "styling_tips": "Pair these cargo shorts with a graphic tee and sneakers for an easy, everyday outfit. On cooler days, add a hoodie or lightweight zip-up jacket. For outdoor adventures, match them with a breathable polo and a baseball cap. Choose sandals or slip-ons for playdates and casual outings. Let your child’s personality shine by mixing colors and patterns — these shorts go with almost anything in an active boy’s wardrobe.",
        "key_features": [
        "Offers great coverage and freedom of movement",
        "Lightweight and perfect for warm weather",
        "Suitable for school, sports, travel, and casual outings",
        "Choose from earthy neutrals, camo prints, or bold tones"
      ],
        "imageArray": [
          { "id": 1, "url": "/images/product-10.png" }
          
        ],
 "productreview": [
          { 
            "id": 1, 
            "images": "/images/review-10.jpg",
            "proName":"Amanda W.",
            "text":"These cargo shorts are durable, flexible, and have plenty of pocket space for all the little things my son insists on carrying. They hold up great after lots of play and washes!",
            "date":"June 12, 2025"
          },
          { 
            "id": 2, 
            "images": "/images/review-10-1.jpg",
            "proName":"Daniel T.",
            "text":"My 9-year-old loves these! The fit is just right—not too tight, not too baggy—and the fabric is breathable. One pocket button came loose after a few washes, but easy to fix.",
            "updatedate":"June 18, 2025"
          },
          { 
            "id": 3, 
            "images": "/images/review-10-2.jpg",
            "proName":"Stephanie R.",
            "text":"Bought two pairs for my twin boys, and they both love them. They’re comfortable for running around and still look good enough for casual outings. Big win!",
            "date":"June 20, 2025"
          }
        ]
},
{
  "id":11,
  "product_name": "Classic Striped Button-Up Shirt",
  "product_type":"Shirt",
  "mrp_price": "49.00",
  "marked_price":"165.00",
  "image_url": "/images/product-11.png",
  "default_size": "XS",
  "mark_discount":"SALE!",
  "stock":"16",
  "quantity": 1,             
        "currency": "$",
       
        "review":"5.0 (80 reviews)",
        "category":"Women",
        "product_desc": "Elevate your everyday style with this classic striped button-up shirt. Featuring a timeless design and tailored fit, it’s perfect for both casual and formal occasions, offering versatility, comfort, and effortless sophistication.",
        "product_desc1": "This classic striped button-up shirt brings timeless style to your wardrobe. Crafted from soft, breathable fabric, it features a tailored fit, button-down collar, and crisp stripes for a polished look. Ideal for work, dinners, or casual weekends, it pairs seamlessly with jeans, chinos, or trousers. Whether tucked in or worn loose, this shirt delivers effortless elegance and versatile wearability, making it a must-have staple for every modern wardrobe.",
        "styling_tips": "For a smart-casual look, pair the striped button-up shirt with chinos or dark jeans and loafers. Tuck it in with a belt for the office or leave it untucked with rolled-up sleeves for a relaxed weekend vibe. Layer under a blazer or cardigan for added sophistication. For women, pair with a pencil skirt or high-waisted trousers; for men, try layering over a white tee and leaving it unbuttoned for a laid-back style.",
        "key_features": [
        "Classic vertical stripes that never go out of style",
        "Traditional closure for a polished, versatile look",
        "Soft cotton or cotton-blend material for all-day comfort",
        "Machine washable and wrinkle-resistant options"
      ],
        "imageArray": [
          { "id": 1, "url": "/images/product-11.png" },
          { "id": 2, "url": "/images/product-11-1.png" }
          
          
          
        ],
 "productreview": [
          { 
            "id": 1, 
            "images": "/images/review-11.jpg",
            "proName":"Isha M",
            "text":"This shirt is a closet essential. The stripes are clean and subtle—perfect for both work and casual wear. The fabric feels breathable, and it tucks in nicely without bunching.",
            "date":"June 11, 2025"
          },
          { 
            "id": 2, 
            "images": "/images/review-11-1.jpg",
            "proName":"Aria Bennett",
            "text":"Love the style and the lightweight material. Just a heads-up: it has a slim fit through the torso, so size up if you prefer a relaxed feel. Still a great shirt overall!",
            "updatedate":"June 18, 2025"
          },
          { 
            "id": 3, 
            "images": "/images/review-11-2.jpg",
            "proName":"Aurora S.",
            "text":"I bought this for a family gathering and ended up wearing it to a business dinner too. Looks sharp with jeans or chinos. Got compliments both times!",
            "date":"June 21, 2025"
          }
        ]
},
{
  "id":12,
  "product_name": "Classic Button-Down Shirt",
  "product_type":"Shirt",
  "mrp_price": "42.90",
  "marked_price": "101.20",
  "image_url": "/images/product-12.png",
  "default_size": "L",
  "mark_discount":"SALE!",
  "stock":"16",
  "quantity": 1,              
        "currency": "$",
        
        "review":"5.0 (84 reviews)",
       "category":"Man",
        "product_desc": "Timeless and versatile, this classic button-down shirt offers a clean, structured look for any occasion. Made with breathable fabric and a tailored fit, it transitions effortlessly from office hours to casual outings.",
        "product_desc1": "A wardrobe essential, this classic button-down shirt is designed for timeless style and everyday comfort. Crafted from breathable, high-quality fabric, it features a crisp collar, button-front closure, and a flattering tailored fit. Perfect for both formal and casual settings, it pairs effortlessly with trousers, jeans, or skirts. Whether worn alone or layered under a blazer or sweater, this shirt brings polished ease to any outfit.",
        "styling_tips": "For a polished office look, tuck the shirt into tailored trousers or a pencil skirt and add loafers or heels. On weekends, roll up the sleeves and wear with jeans or chinos for a relaxed vibe. Layer it under a blazer or cardigan for added warmth and style, or tie it at the waist over a dress for a trendy twist. Accessorize with a watch, minimalist jewelry, or a structured bag for a refined finish.",
        "key_features": [
        "Flattering silhouette that works for both formal and casual wear",
        "Easy to dress up or down, perfect for work or weekends",
        "Reinforced seams and quality stitching for long-lasting wear",
        "Machine washable and wrinkle-resistant options available",
        "Suitable for men, women, or as a gender-neutral style staple"
      ],
        "imageArray": [
          { "id": 1, "url": "/images/product-12.png" },
          { "id": 2, "url": "/images/product-12-1.png" },
          { "id": 3, "url": "/images/product-12-2.png" }
         
         
        ],
  "productreview": [
          { 
            "id": 1, 
            "images": "/images/review-12.jpg",
            "proName":"Thomas J.",
            "text":"This shirt is exactly what I needed—clean lines, perfect collar, and a flattering fit. Great for business casual looks or weekend outings. Fabric is soft but holds structure well.",
            "date":"June 11, 2025"
          },
          { 
            "id": 2, 
            "images": "/images/review-12-1.jpg",
            "proName":"Andrew B.",
            "text":"I've worn this shirt to the office and on casual Fridays. It’s versatile and lightweight, and the buttons feel securely stitched. Docking one star only because I prefer a slightly slimmer cut.",
            "updatedate":"June 19, 2025"
          },
          { 
            "id": 3, 
            "images": "/images/review-12-2.jpg",
            "proName":"Kevin M.",
            "text":"This button-down checks all the boxes: quality material, proper fit, and wrinkle resistance. It pairs great with dress pants or jeans. Ordering more colors soon!",
            "date":"June 22, 2025"
          }
        ]
}
]

  }